{
    "Rules": [
      {
        "Name": "Dupes Clause",
        "Difficulty": 0,
        "Description": "A 'dupe' (short for duplicate) is a Pokemon which appears as a first encounter but belongs to the same species as a Pokemon that has already been caught. The Dupes Clause means that if the first Pokemon encountered in an area is a dupe, the player may ignore it and catch the first non-dupe encounter instead. The motivation for this rule is to increase the variety of Pokemon on a player's team. The Dupes Clause is considered acceptable in a Nuzlocke challenge. Many variants on this rule exist: the rule may be extended to include any Pokemon belonging to the same evolutionary family as a previously caught Pokemon; for a harsher variant, if the first encounter in an area is a dupe, no Pokemon may be captured in the area; the player may get a limited number of tries to find a non-dupe."
      },
      {
        "Name": "Set Mode",
        "Difficulty": 2,
        "Description": "Every Pokemon game has two possible ways to play: Switch Mode, which allows you to switch Pokemon after knocking out an opponent, and Set Mode, which doesn't give you this option. This makes the game more difficult as it removes the player's ability to perform perfectly safe switches. You can toggle between Shift and Set in the in-game Options menu."
      },
      {
        "Name": "Monotype",
        "Difficulty": 3,
        "Description": "A variant on the Nuzlocke challenge in which all the Pokemon used must be of the same type. The first encounter rule is often modified so as to allow the first Pokemon of the chosen type in each area to be caught."
      },
      {
        "Name": "No items in battle",
        "Difficulty": 3,
        "Description": "The player is not allowed to use any items during battle including healing items, X-items, etc. The use of held items is generally permitted, however."
      },
      {
        "Name": "Wedlocke",
        "Difficulty": 4,
        "Description": "A variant on the Nuzlocke challenge based on the idea that Pokemon in the team form romantic partnerships based on the order in which they are caught. Pokemon that are partnered must fight together in 'double' battles and may not switch out in battle except with their partner. If a party Pokemon does not have a partner, the encounter rules are modified so that a Pokemon of the opposite gender must be caught next. These rules may be altered to allow or require same-sex partnerships. Wedlockes can be notoriously difficult as the player will always essentially be fighting with a team of two Pokemon."
      },
      {
        "Name": "Level limit",
        "Difficulty": 1,
        "Description": "A maximum level allowed for the player's Pokemon when entering a Gym battle. This level is often based on either the highest-leveled or lowest-leveled Pokemon of the Gym Leader, with further adjustments being up to the player."
      },
      {
        "Name": "Superless",
        "Difficulty": 4,
        "Description": "Super effective moves may never be used by the player's Pokemon."
      },
      {
        "Name": "STABless",
        "Difficulty": 4,
        "Description": "STAB (same-type attack bonus) moves may never be used by the player's Pokemon. In other words, damage-dealing moves that have the same type as one of the types of the Pokemon using the move are not permitted."
      },
      {
        "Name": "Notepad",
        "Difficulty": 3,
        "Description": "Pokemon cannot be stored in the PC. If the party is full, no additional Pokemon can be caught until a space is opened by a death. This variant is named after Notepad's runs (Freddy's Blue Nuzlocke and Freddy's Gold Nuzlocke). A less strict variant allows spare Pokemon to be captured, but not rotated into the party until one of the party Pokemon dies (see the Teamlocke). A stricter variant lets you catch six Pokemon, but does not allow them to be replaced in the event of a death."
      },
      {
        "Name": "Teamlocke",
        "Difficulty": 2,
        "Description": "A variant in which the player is not allowed to remove living Pokemon from their party. The player is still permitted to catch Pokemon when their team is full, a feature that distinguishes Teamlockes from Notepad runs. Essentially, the PC may only be used when the player needs to replace a dead party member."
      },
      {
        "Name": "No evolution",
        "Difficulty": 4,
        "Description": "The player is not allowed to evolve any of their Pokemon in any manner. A stricter variant disallows the player from using Pokemon that are evolved forms (for example, a Pidgeotto caught in the wild)."
      },
      {
        "Name": "No starter",
        "Difficulty": 1,
        "Description": "The player is not allowed to use their starter or its evolutions and must replace it with their first catch."
      },
      {
        "Name": "Unlocke",
        "Difficulty": 2,
        "Description": "The player unlocks types upon defeating Gym Leaders, often corresponding to the Gym Leader's preferred type. The player may only use Pokemon that have at least one of their types unlocked. A more difficult variant may disallow dual-typed Pokemon from being used until both of their types have been unlocked."
      },
      {
        "Name": "Alphabetlocke",
        "Difficulty": 1,
        "Description": "A variant based on the alphabet. If the new capture in a certain area starts with a letter that comes before the first letter in another team member's name, you must replace the old team member with the new one. This can be done with Pokemon names, nicknames, or species names. For a more complex version that involves more team-switching, see the ABC-locke." 
      },
      {
        "Name": "ABC-locke",
        "Difficulty": 2,
        "Description": "Invented by Macktavious and based off of the Alphabetlocke. As explained in the rules for the Black 2 ABC-locke: 'My Pokemon shall be given nicknames starting with a randomly selected letter of the alphabet. My team shall be selected based on the alphabet. I shall have to fill my team based on their Pokemon names (e.g. Bulbasaur). The first six alphabetically will be my party. However, once I enter a new city, or defeat a gym leader, the rule changes, and Pokemon will be selected based on the first letters of their nicknames instead. The second time this happens, they will be selected based on their species name ('Seed Pokemon' for Bulbasaur), and after the third time, the cycle will rotate back to their Pokemon names.'"
      },
      {
        "Name": "No fleeing",
        "Difficulty": 1,
        "Description": "The player is not allowed to ever flee from wild battles. Some variants also require the player to battle every trainer possible."
      },
      {
        "Name": "Blind run",
        "Difficulty": 2,
        "Description": "Playing a game ‘blind’ means playing it for the first time without any prior knowledge and without looking anything up about the game."
      },
      {
        "Name": "Egglocke",
        "Difficulty": 2,
        "Description": "A variant on the Nuzlocke challenge in which new Pokemon are hatched from unknown eggs rather than captured. Prior to starting the challenge, the player solicits a large number of eggs from other players. Whenever an area is reached where a catch would normally occur, the player may hatch an egg."
      },
      {
        "Name": "Wonderlocke",
        "Difficulty": 2,
        "Description": "A variant on the Nuzlocke challenge in which new Pokémon are acquired using the Wonder Trade feature introduced in Pokémon X and Y. The player catches the first Pokémon encountered in each area, but must immediately wonder trade it for a new Pokémon. Depending on the rules used, the player may be allowed to wonder trade the Pokémon again if its level is too high."
      },
      {
        "Name": "No Exp. Share (Generation 6+)",
        "Difficulty": 2,
        "Description": "The player must have the Exp. Share off for the duration of the game. Only applicable to Generation 6 and 7 games."
      },
      {
        "Name": "Soul link",
        "Difficulty": 2,
        "Description": "A soul link involves two players playing games from the same region simultaneously. Pokemon caught in the same area are linked - if one player has the Pokemon on their team, the other player must as well. In addition, if a Pokemon dies, the other player’s linked Pokemon dies as well."
      },
      {
        "Name": "Team Rainbow",
        "Difficulty": 1,
        "Description": "The player is not allowed to have any overlapping types on their team."
      },
      {
        "Name": "No grinding",
        "Difficulty": 2,
        "Description": "The player is not allowed to grind against wild Pokemon and must avoid them or flee from them if whenever possible."
      },
      {
        "Name": "Required battles only",
        "Difficulty": 3,
        "Description": "The player may only take part in unavoidable battles. Wild Pokemon and avoidable trainers must be avoided whenever possible."
      },
      {
        "Name": "Limited items in battle (1-3)",
        "Difficulty": 2,
        "Description": "The player may only use a certain amount of items (for this rule, the limit must be between 1 and 3, inclusive) during battle including healing items, X-items, etc. The use of held items is generally permitted, however."
      },
      {
        "Name": "Limited items in battle (4-5)",
        "Difficulty": 1,
        "Description": "The player may only use a certain amount of items (for this rule, the limit must be 4 or 5) during battle including healing items, X-items, etc. The use of held items is generally permitted, however."
      },
      {
        "Name": "Dupes Clause (Restrictive)",
        "Difficulty": 1,
        "Description": "A harsher variant of the regular Dupes Clause (see above). If the first encounter in an area is a dupe, no Pokemon may be captured in the area. Alternatively the player may get a limited number of tries to find a non-dupe."
      },
      {
        "Name": "Wild Card (Difficulty 1)",
        "Difficulty": 1,
        "Description": "Use this for a rule that you can't find on the site. A wild card rule of difficulty 1 should make the run slightly more difficult."
      },
      {
        "Name": "Wild Card (Difficulty 2)",
        "Difficulty": 2,
        "Description": "Use this for a rule that you can't find on the site. A wild card rule of difficulty 2 should make the run more difficult."
      },
      {
        "Name": "Wild Card (Difficulty 3)",
        "Difficulty": 3,
        "Description": "Use this for a rule that you can't find on the site. A wild card rule of difficulty 3 should make the run significantly more difficult."
      },
      {
        "Name": "Wild Card (Difficulty 4)",
        "Difficulty": 4,
        "Description": "Use this for a rule that you can't find on the site. A wild card rule of difficulty 4 should raise the run's difficulty to a point at which the dynamic of the run changes dramatically."
      },
      {
        "Name": "Generationlocke",
        "Difficulty": 2,
        "Description": "The player may only use one Pokemon from each generation on their team at a time."
      }
    ]
  }